{
    "filmes": [
        { 
            "id": 1,
            "titulo": "Akira",
            "ano": 1988, 
            "roteiro": "Katsuhiro Otomo",
            "sinopse": "Uma grande explosão fez com que Tóquio fosse destruída em 1988. Em seu lugar foi construída Neo Tóquio, que, em 2019, sofre com atentados terroristas por toda a cidade. Kaneda (Mitsuo Iwata) e Tetsuo (Nozomu Sasaki) são amigos que integram uma gangue de motoqueiros. Eles disputam rachas violentos com uma gangue rival, os Palhaços, até que um dia Tetsuo encontra Takashi (Tatsuhiko Nakamura), uma estranha criança com poderes que fugiu do hospital onde era mantido como cobaia. Tetsuo é ferido no encontro e antes de receber a ajuda dos amigos é levado por integrantes do exército, liderados pelo coronel Shikishima (Tarô Ishida). A partir de então Tetsuo passa a desenvolver poderes inimagináveis, o que faz com que seja comparado ao lendário Akira, responsável pela explosão de 1988. Paralelamente, Kaneda se interessa por Kei (Mami Koyama), uma garota envolvida com espiões que tenta decifrar o enigma por trás das cobaias controladas pelo exército.",
            "imagem": "https://img.elo7.com.br/product/original/2C150E0/big-poster-filme-anime-akira-lo001-tamanho-90x60-cm-manga.jpg"
        }, 
        {
            "titulo": "Mortal Kombat",
            "ano": 1995, 
            "roteiro": "Paul W. S. Anderson",
            "sinopse": "Após nove combates, sempre vencido por forças malignas, três relutantes lutadores: Johnny Cage (Lindsen Ashby), um astro de filmes de ação; Sonya Blade (Bridgette Wilson), uma agente especial; e Liu Kang (Robin Shou), um lutador; são mandados para uma remota ilha, onde enfrentarão mortais adversários em um torneio de kung fu no qual o destino da Terra está em jogo. Lá eles apenas têm a ajuda de Lord Rayden (Christopher Lambert), um mago, para orientá-los nesta difícil missão.",
            "imagem": "https://m.media-amazon.com/images/M/MV5BNjY5NTEzZGItMGY3My00NzE4LThkYTUtYjJkNzk3MDBiMWE3XkEyXkFqcGdeQXVyNzg5MDE1MDk@._V1_.jpg",
            "id": 2
        }, 
        {
            "titulo": "Adão Negro",
            "ano": 2022, 
            "roteiro": "Adam Sztykiel",
            "sinopse": "Adão Negro é o filme solo do anti-herói, baseado no personagem em quadrinhos Black Adam (Dwayne Johnson) da DC Comics, grande antagonista de Shazam!, tendo no longa, sua história de origem explorada, e revelando seu passado de escravo no país Kahndaq. Nascido no Egito Antigo, o anti-herói tem super força, velocidade, resistência, capacidade de voar e de disparar raios. Alter ego de Teth-Adam e filho do faraó Ramsés II, Adão Negro foi consumido por poderes mágicos e transformado em um feiticeiro. Grande inimigo de Shazam! nas HQs, apesar dele acreditar em seu pontecial e, inclusive, oferecê-lo como um guerreiro do bem, Adão Negro acaba usando suas habilidades especiais para o mal. O anti-herói em busca de redenção ou um herói que se tornou vilão, pode ser capaz de destruir tudo o que estiver pela frente - ou de encontrar seu caminho.",
            "imagem": "https://m.media-amazon.com/images/M/MV5BYzZkOGUwMzMtMTgyNS00YjFlLTg5NzYtZTE3Y2E5YTA5NWIyXkEyXkFqcGdeQXVyMjkwOTAyMDU@._V1_.jpg",
            "id": 3
        },
        {
            "titulo": "Pulp Fiction",
            "ano": 1995,
            "roteiro": "Quentin Tarantino",
            "sinopse": "Vincent Vega (John Travolta) e Jules Winnfield (Samuel L. Jackson) são dois assassinos profissionais trabalham fazendo cobranças para Marsellus Wallace (Ving Rhames), um poderosos gângster. Vega é forçado a sair com a garota do chefe, temendo passar dos limites; enquanto isso, o pugilista Butch Coolidge (Bruce Willis) se mete em apuros por ganhar luta que deveria perder.",
            "imagem": "https://img.elo7.com.br/product/original/268A58D/big-poster-filme-pulp-fiction-lo001-tamanho-90x60-cm-presente-geek.jpg",
            "id": 4
        },
        {
            "titulo": "Ghost in the Shell",
            "ano": 1995,
            "roteiro": "Mamoru Oshii",
            "sinopse": "Ghost in The Shell apresenta uma trama onde o mundo se tornou um local altamente informatizado, a ponto dos seres humanos poderem acessar extensas redes de informações com seus ciber-cérebros. A agente cibernética Major Motoko é a líder da unidade de serviço secreto Esquadrão Shell, combatente do crime. Motoko foi tão modificada que quase todo seu corpo já é robótico. O governo informa ao grupo de que o famoso hacker conhecido ''Mestre das Marionetes'', especialista em invadir e controlar o ciber-cérebro das pessoas, está no Japão. Agora, Motoko e sua equipe terão que caçar esse criminoso, e vão acabar se envolvendo em uma trama de conspirações que atinge interesses da alta cúpula política.",
            "imagem": "https://i.pinimg.com/originals/75/d1/57/75d157276e6ed51fbac6770ab54b98e7.jpg",
            "id": 5
        },
        {
            "titulo": "Perfect Blue",
            "ano": 1997,
            "roteiro": "Satoshi Kon",
            "sinopse": "Mima Kirigoe é uma cantora pop de uma banda CHAM!, mas decide se tornar uma atriz, tendo como primeiro projeto uma série de crime dramática. Muitos de seus fãs ficam chateados com sua decisão e uns deles, obcecado por Mima, começa a perseguí-la e a enviar mensagens a chamando de traidora. Decidida a ignorar tais fatos, ela se preocupa com sua personagem na série que sofrerá um sequestro em um dos episódios. Sem ter noção da possibilidade de ser afetada pela cena, Mima fica traumatizada e começa a não saber distinguir a realidade da ficção. Seu problema maior começa quando seus colegas de trabalho são assassinados e as provas apontam para ela mesma.",
            "imagem": "https://m.media-amazon.com/images/M/MV5BMmMzOWNhNTYtYmY0My00OGJiLWIzNDUtZWRhNGY0NWFjNzFmXkEyXkFqcGdeQXVyNjUxMDQ0MTg@._V1_.jpg",
            "id": 6
        }


        
    ], 
    "info": [
        {
            "genero": "Ficção Cientifica",
            "subgenero": "Ação",
            "id": 1
        }, 
        {
            "genero": "Ação",
            "subgenero": "Aventura",
            "id": 2
        },
        {
            "genero": "Aventura",
            "subgenero": "Ação",
            "id": 3
        },
        {
            "genero": "Crime", 
            "subgenero": "Drama",
            "id": 4 
        }, 
        {
            "genero": "Ação", 
            "subgenero": "Ficção Cientifica",
            "id": 5
        },
        {
            "genero": "Thriller",
            "subgenero": "Mistério",
            "id": 6
        }
    ],
    "preco": [ 
        {
            "sala": "Sala Premium",
            "valor": "R$40",
            "valorMeia": "R$20",
            "id": 1
        },
        {
            "sala": "Sala Simples",
            "valor": "R$30",
            "valorMeia": "R$15",
            "id": 2
        },
        {
            "sala": "React Plus",
            "valor": "R$50",
            "valorMeia":"R$25",
            "id": 3
        },
        {
            "sala": "VIP",
            "valor": "R$100",
            "valorMeia": "R$50",
            "id": 4
        }, 
        {
            "sala": "React Basic",
            "valor": "R$10",
            "valorMeia": "R$5",
            "id": 5
        },
        { 
            "sala": "Caverna",
            "valor": "R$5",
            "valorMeia": "R$2",
            "id": 6
        }
    ],
    "cinemas": [
        {
            "local": "Liberdade",
            "estado": "SP",
            "id": 1
        },
        {
            "local": "SENAC - Campo Grande",
            "estado": "RJ",
            "id": 2
        },
        {
            "local": "Manaus",
            "estado": "AM",
            "id": 3
        },
        {
            "local": "Belo Horizonte",
            "estado": "MG",
            "id": 4
        }, 
        {
            "local": "Montenegro",
            "estado": "RS",
            "id": 5
        },
        {
            "local": "Aroe Jari",
            "estado": "MT",
            "id": 6
        }

    ]

}
